# Maîtriser l'utilisation du paramètre "axis" dans Pandas

Q : Read the df_axis.csv into a DataFrame?

In [8]:
import pandas as pd
import numpy as np
import os 
pd.set_option('max_rows',10 )
path='/Users/william/Documents/data'
os.chdir(path)
df_axis= pd.read_table("df_axis.csv", sep=',' )
df_axis.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

Q : Drop the column "continent"?
Tips : use drop method with the parameter axis.

In [9]:
df_axis.drop(['continent'], axis=1)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9
...,...,...,...,...,...
188,Venezuela,333,100,3,7.7
189,Vietnam,111,2,1,2.0
190,Yemen,6,0,0,0.1
191,Zambia,32,19,4,2.5
192,Zimbabwe,64,18,4,4.7

Q : Drop the 2sd ligne? 
Indication : use always drop method with the parameter axis.

In [10]:
df_axis.drop(1)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
5,Antigua & Barbuda,102,128,45,4.9,North America
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

Q : Calculate the mean of each numeric column?

In [5]:
df_axis.mean()

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

Q : Calculate the mean of each row?

In [11]:
df_axis.mean(axis=1)

0        0.000
1       69.975
2        9.925
3      176.850
4       81.225
        ...
188    110.925
189     29.000
190      1.525
191     14.375
192     22.675
Length: 193, dtype: float64

Q : Recalculate the mean of each row (by specification of 'index' argument)?

In [12]:
df_axis.mean(axis='index')

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

Q : Recalculate the mean of each columns (by specification of 'columns' argument)?

In [14]:
df_axis.mean(axis=1)

beer_servings                   106.160622
spirit_servings                  80.994819
wine_servings                    49.450777
total_litres_of_pure_alcohol      4.717098
dtype: float64

SyntaxError: invalid syntax (<ipython-input-7-8a2528897a77>, line 1)